## **[MySQL DELETE](https://www.mysqltutorial.org/mysql-delete-statement.aspx)**

Use the MySQL DELETE statement to delete data from a single table.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL DELETE statement

DELETE FROM table_name
WHERE condition;

### MySQL DELETE examples

create a new table:

In [3]:
copy_table = '''
CREATE TABLE employ 
AS
SELECT * FROM employees
;'''

engine.execute('DROP TABLE IF EXISTS employ')
engine.execute(copy_table)

/tmp/ipykernel_7571/2532493191.py:7: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('DROP TABLE IF EXISTS employ')

In [4]:
string = '''
SELECT DISTINCT officeCode
FROM employ
ORDER BY officeCode
;'''

pd.read_sql(string, engine)

  officeCode
0          1
1          2
2          3
3          4
4          5
5          6
6          7

In [5]:
# delete employees whose the officeNumber is 4
string = '''
DELETE FROM employ
WHERE officeCode = 4
;'''

engine.execute(string)

string = '''
SELECT DISTINCT officeCode
FROM employ
ORDER BY officeCode
;'''

pd.read_sql(string, engine)

  officeCode
0          1
1          2
2          3
3          5
4          6
5          7

In [6]:
pd.DataFrame({
    'officeCode': (
        pd.read_sql_table('employees', engine)
        .query("officeCode != '4'")
        .officeCode.unique())}
).sort_values('officeCode', ignore_index=True)

  officeCode
0          1
1          2
2          3
3          5
4          6
5          7

In [7]:
engine.execute('DELETE FROM employ;')

pd.read_sql('SELECT COUNT(*) FROM employ', engine)

   COUNT(*)
0         0

In [8]:
engine.execute('DROP TABLE IF EXISTS employ')

### MySQL DELETE and LIMIT clause

# Limit the number of rows to delete, should always use ORDER BY

DELETE FROM table_name
ORDER BY c1, c2, ...
LIMIT row_count;

In [9]:
# make a copy of customers
copy_table = '''
CREATE TABLE custom
AS
SELECT * FROM customers
;'''

engine.execute('DROP TABLE IF EXISTS custom')
engine.execute(copy_table)

# number of custom's rows:
pd.read_sql('SELECT COUNT(*) as count FROM custom', engine)

   count
0    122

In [10]:
# the first 10 customers:
string = '''
SELECT customerName
FROM custom
ORDER BY customerName
LIMIT 10
;'''

pd.read_sql(string, engine)

                   customerName
0                  Alpha Cognac
1        American Souvenirs Inc
2            Amica Models & Co.
3                 ANG Resellers
4       Anna's Decorations, Ltd
5           Anton Designs, Ltd.
6    Asian Shopping Network, Co
7         Asian Treasures, Inc.
8             Atelier graphique
9  Australian Collectables, Ltd

In [11]:
# delete the first 10 customers:
string = '''
DELETE FROM custom
ORDER BY customerName
LIMIT 10
;'''

engine.execute(string)
pd.read_sql('SELECT COUNT(*) as count FROM custom', engine)

   count
0    112

In [12]:
string = '''
SELECT *
FROM custom
ORDER BY customerName
;'''

df1 = pd.read_sql(string, engine)

In [13]:
df2 = (
    pd.read_sql_table('customers', engine)
    .sort_values('customerName', key=lambda col: col.str.upper())
    .iloc[10:, :]
    .reset_index(drop=True)
)

In [14]:
df1.equals(df2)

True

In [15]:
# the first 5 lowest credit Limit customers in France
string = '''
SELECT customerNumber
FROM custom
WHERE country = 'France'
ORDER BY creditLimit, customerNumber
LIMIT 5
;'''

pd.read_sql(string, engine)

   customerNumber
0             209
1             350
2             250
3             256
4             353

In [16]:
# select customers in France, sorts them by credit limit from
# low to high, and deletes the first 5 customers
string = '''
DELETE FROM custom
WHERE country = 'France'
ORDER BY creditLimit, customerNumber
LIMIT 5;
'''

engine.execute(string)

In [17]:
string = '''
SELECT *
FROM custom
ORDER BY customerNumber
;'''

df1 = pd.read_sql(string, engine)

print(df1.shape)

(107, 13)

In [18]:
cusnum = (
    df2
    .query("country == 'France'") 
    .sort_values(['creditLimit', 'customerNumber'], ignore_index=True)
    .loc[:4, 'customerNumber']
    .values
)
cusnum

array([209, 350, 250, 256, 353])

In [19]:
df2 = (
    df2
    .query("customerNumber not in @cusnum")
    .sort_values(by='customerNumber', ignore_index=True)
)

In [20]:
df1.equals(df2)

True

In [21]:
engine.execute('DROP TABLE IF EXISTS custom')